
## Plan Result

[CI link](https://github.com/hikobend/aws-sample-architecture-1/actions/runs/5103309006)


<pre><code>Plan: 3 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.security_group.module.alb_sg.aws_security_group.this_name_prefix[0]
  * module.security_group.module.alb_sg.aws_security_group_rule.egress_with_cidr_blocks[0]
  * module.security_group.module.alb_sg.aws_security_group_rule.ingress_rules[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.security_group.module.alb_sg.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "ALB security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "dev-alb-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Env"  = "dev"
          + "Name" = "dev-alb-sg"
        }
      + tags_all               = {
          + "Env"  = "dev"
          + "Name" = "dev-alb-sg"
        }
      + vpc_id                 = "vpc-0e4e9c5896482113d"

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.security_group.module.alb_sg.aws_security_group_rule.egress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "egress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "alb-sg-role-egress-ALL"
      + from_port                = -1
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

  # module.security_group.module.alb_sg.aws_security_group_rule.ingress_rules[0] will be created
  + resource "aws_security_group_rule" "ingress_rules" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + description              = "HTTP"
      + from_port                = 80
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform_plan","PRNumber":21,"Program":"tfcmt","SHA1":"dfd0c40f32871b49f805bd6859fd12aec29ddda2","Vars":{},"WorkflowName":"terraform plan"} -->